app/views/states/_state.html.erb

  <div class="d-grid gap-2 ml-1 mr-1">
    <% state.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."state_id" = $1  [["state_id", 14]]