app/views/boards/_board.html.erb

SELECT "states".* FROM "states" WHERE "states"."board_id" = $1  [["board_id", 5]]
---
  <div class="row">
    <% @board.states.each do |state| %>