app/views/boards/new.html.erb

      <%= form.label :user_id, 'Owner', class: 'form-label' %>
      <%= form.collection_select :user_id, User.all, :id, :name, { prompt: "Choose an owner" }, { class: 'form-control' } %>
---
SELECT "users".* FROM "users"