app/views/boards/show.html.erb

  <h3>States:</h3>
  <% @board.states.each do |state| %>
---
SELECT "states".* FROM "states" WHERE "states"."board_id" = $1  [["board_id", 17]]

      <h4><%= state.name %></h4>
      <% state.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."state_id" = $1  [["state_id", 65]]