app/controllers/boards_controller.rb

    def index
      @boards = Board.all
---
SELECT "boards".* FROM "boards"