app/controllers/boards_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      @board = Board.find(params[:id])

INSERT INTO "boards" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "prueba"], ["description", "board de prueba"], ["user_id", 4], ["created_at", "2024-05-21 02:47:22.312642"], ["updated_at", "2024-05-21 02:47:22.312642"]]
---
    def create
      @board = Board.new(board_params)
      if @board.save

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def edit
      @board = Board.find(params[:id])

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "boards" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "boards"."id" = $4  [["name", "Board 1 for user1 editado"], ["description", "Description for Board 1 created by user1 editada"], ["updated_at", "2024-05-21 02:58:20.379896"], ["id", 4]]
---
    def update
      @board = Board.find(params[:id])
      if @board.update(board_params)

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 3]]
---
    def destroy
      @board = Board.find(params[:id])
      @board.destroy

INSERT INTO "states" ("name", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Done"], ["board_id", 7], ["created_at", "2024-05-22 21:09:15.172862"], ["updated_at", "2024-05-22 21:09:15.172862"]]
---
    def create_basic_states
      State.new(name: "To Do", board_id: @board.id).save