app/controllers/home_controller.rb

SELECT "boards".* FROM "boards"
---
  def index
    @boards = Board.all