app/controllers/home_controller.rb

SELECT "boards".* FROM "boards" ORDER BY "boards"."id" DESC LIMIT $1  [["LIMIT", 3]]
---
  def index
    @boards = Board.includes(:tasks).last(3)  # Load the last three boards