app/controllers/home_controller.rb

  def index
    @latest_boards = Board.includes(:states, :tasks).order('created_at DESC').limit(3)
---
SELECT "boards".* FROM "boards" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 3]]
SELECT "states".* FROM "states" WHERE "states"."board_id" IN ($1, $2, $3)  [["board_id", 7], ["board_id", 6], ["board_id", 5]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."state_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9)  [["state_id", 11], ["state_id", 12], ["state_id", 13], ["state_id", 14], ["state_id", 15], ["state_id", 16], ["state_id", 17], ["state_id", 18], ["state_id", 19]]