app/controllers/states_controller.rb

  def index
    @states = State.all
    if params[:board_id]
      @board = Board.find(params[:board_id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def show
    @state = State.find(params[:id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def new
    @state = State.new
    if params[:board_id]
      @board = Board.find(params[:board_id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    if params[:board_id]
      @board = Board.find(params[:board_id])
      @board.state = State.new(state_params)
    else
      @state = State.new(state_params)
    end
      respond_to do |format|
        if @state.save!
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "states" ("name", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "dwaxawd"], ["board_id", 5], ["created_at", "2024-05-22 04:17:58.174181"], ["updated_at", "2024-05-22 04:17:58.174181"]]

  def edit
    @state = State.find(params[:id])
    if params[:board_id]
      @board = Board.find(params[:board_id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @state = State.find(params[:id])
    if @state.update(state_params)
---
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "states" SET "name" = $1, "updated_at" = $2 WHERE "states"."id" = $3  [["name", "State 1 for Board 2 for user1dwad"], ["updated_at", "2024-05-22 05:11:24.016482"], ["id", 6]]

  def destroy
    @state = State.find(params[:id])
    @state.destroy
---
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "states" WHERE "states"."id" = $1  [["id", 21]]