app/controllers/tasks_controller.rb

  def new
    @task = Task.new
    if params[:state_id]
      @state = State.find(params[:state_id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

  def create
    if params[:state_id]
      @state = State.find(params[:state_id])
      @state.task = Task.new(task_params)

    else
      @task = Task.new(task_params)
    end
    respond_to do |format|
      if @task.save!
        @state = State.find(@task.state_id)
        @board = Board.find(@state.board_id)
---
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
INSERT INTO "tasks" ("title", "description", "state_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", nil], ["description", ""], ["state_id", 16], ["created_at", "2024-05-22 20:32:42.470817"], ["updated_at", "2024-05-22 20:32:42.470817"]]
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def edit
    @task = Task.find(params[:id])

    if params[:state_id]
      @state = State.find(params[:state_id])
    end
    if params[:board_id]
      @board = Board.find(params[:board_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 151], ["LIMIT", 1]]
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)
      @state = State.find(@task.state_id)
      @board = Board.find(@state.board_id)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["title", "aadwa"], ["updated_at", "2024-06-06 20:18:33.880965"], ["id", 83]]
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
    respond_to do |format|
      @state = State.find(@task.state_id)
        @board = Board.find(@state.board_id)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 71], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 71]]
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]